____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 96, 64, 3)     0                                            
____________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D) (None, 98, 66, 3)     0           input_2[0][0]                    
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 48, 32, 64)    3136        zero_padding2d_6[0][0]           
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 48, 32, 64)    0           conv2d_6[0][0]                   
____________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D) (None, 50, 34, 64)    0           activation_11[0][0]              
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 24, 16, 128)   131200      zero_padding2d_7[0][0]           
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 24, 16, 128)   512         conv2d_7[0][0]                   
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 24, 16, 128)   0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D) (None, 26, 18, 128)   0           activation_12[0][0]              
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 12, 8, 256)    524544      zero_padding2d_8[0][0]           
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 12, 8, 256)    1024        conv2d_8[0][0]                   
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 12, 8, 256)    0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D) (None, 14, 10, 256)   0           activation_13[0][0]              
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 6, 4, 512)     2097664     zero_padding2d_9[0][0]           
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 6, 4, 512)     2048        conv2d_9[0][0]                   
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 6, 4, 512)     0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2D (None, 8, 6, 512)     0           activation_14[0][0]              
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 3, 2, 512)     4194816     zero_padding2d_10[0][0]          
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 3, 2, 512)     2048        conv2d_10[0][0]                  
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 3, 2, 512)     0           batch_normalization_12[0][0]     
____________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTransp (None, 6, 4, 512)     1049088     activation_15[0][0]              
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 6, 4, 512)     2048        conv2d_transpose_6[0][0]         
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 6, 4, 1024)    0           batch_normalization_13[0][0]     
                                                                   batch_normalization_11[0][0]     
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 6, 4, 1024)    0           concatenate_5[0][0]              
____________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTransp (None, 12, 8, 256)    1048832     activation_16[0][0]              
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 12, 8, 256)    1024        conv2d_transpose_7[0][0]         
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 12, 8, 512)    0           batch_normalization_14[0][0]     
                                                                   batch_normalization_10[0][0]     
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 12, 8, 512)    0           concatenate_6[0][0]              
____________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTransp (None, 24, 16, 128)   262272      activation_17[0][0]              
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 24, 16, 128)   512         conv2d_transpose_8[0][0]         
____________________________________________________________________________________________________
concatenate_7 (Concatenate)      (None, 24, 16, 256)   0           batch_normalization_15[0][0]     
                                                                   batch_normalization_9[0][0]      
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 24, 16, 256)   0           concatenate_7[0][0]              
____________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTransp (None, 48, 32, 64)    65600       activation_18[0][0]              
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 48, 32, 64)    256         conv2d_transpose_9[0][0]         
____________________________________________________________________________________________________
concatenate_8 (Concatenate)      (None, 48, 32, 128)   0           batch_normalization_16[0][0]     
                                                                   conv2d_6[0][0]                   
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 48, 32, 128)   0           concatenate_8[0][0]              
____________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTrans (None, 96, 64, 1)     513         activation_19[0][0]              
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 96, 64, 1)     0           conv2d_transpose_10[0][0]        
====================================================================================================
Total params: 9,387,137
Trainable params: 9,382,401
Non-trainable params: 4,736
____________________________________________________________________________________________________

